[
	{
		"arabic": "اَللَّهُـمَّ إِنِّـي أَسْأَلُـكَ عِلْمـاً نَافِعـاً وَرِزْقـاً طَيِّـباً ، وَعَمَـلاً مُتَقَـبَّلاً",
		"source": "(Ibnu Majah, 3/179, no. 915)",
		"toRepeat": 0,
		"translations":
		[
			{
				"lang": "ms",
				"text": "Ya Allah, sungguh aku memohon kepadaMu ilmu yang manfaat, rezki yang baik dan amal yang diterima (Selepas salam solat Subuh)"
			},
			{
				"lang": "en",
				"text": "O Allah, I ask You for knowledge which is beneficial and sustenance which is good, and deeds which are acceptable. (To be said after giving salam for the Fajr prayer)"
			},
			{
				"lang": "id",
				"text": "Ya Allah, sesungguhnya aku mohon kepada-Mu ilmu yang berguna, rezki yang baik dan amal yang baik diterima."
			}
		]
	},
	{
		"arabic": "أَسْتَغْفِرُ اللَّهَ",
		"source": "",
		"toRepeat": 3,
		"translations":
		[
			{
				"lang": "ms",
				"text": "Aku memohon ampun kepada Allah."
			},
			{
				"lang": "en",
				"text": "I seek the forgiveness of Allah."
			},
			{
				"lang": "id",
				"text": "Aku minta ampun kepada Allah."
			}
		]
	},
	{
		"arabic": "اللَّهُمَّ أَنْتَ السَّلاَمُ، وَمِنْكَ السَّلاَمُ، تَبَارَكْتَ يَا ذَا الْجَلاَلِ وَالإِكْرَامِ",
		"source": "(Muslim, 3/254, no. 931)",
		"toRepeat": 0,
		"translations":
		[
			{
				"lang": "ms",
				"text": "Ya Allah, Engkau yang menyelamatkan, daripadaMu keselamatan, kepadaMu kembali keselamatan. Maka hidupkanlah kami wahai Tuhan, dalam keselamatan. Masukkan kami ke syurga, negara keselamatan. Maha suci Engkau wahai Tuhan kami, Tuhan yang mempunyai kebesaran dan kemuliaan."
			},
			{
				"lang": "en",
				"text": "O Allah, You are As-Salam and from You is all peace, blessed are You, O Possessor of majesty and honour.’ AS-Salam: The One Who is free from all defects and deficiencies"
			},
			{
				"lang": "id",
				"text": "Ya Allah, Engkau pemberi keselamatan, dan dariMu keselamatan, Maha Suci Engkau, wahai Tuhan Yang Pemilik Keagungan dan Kemuliaan."
			}
		]
	},
	{
		"arabic": "لَا إلَهَ إِلاَّ اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ",
		"source": "(al-Bukhari, 3/348, no. 799. Muslim, 3/256, no. 933. at-Tirmidzi, 2/4, no. 275)",
		"toRepeat": 0,
		"translations":
		[
			{
				"lang": "ms",
				"text": "Tiada Tuhan selain Allah dan tiada sekutu bagiNya. BagiNya segala kerajaan dan bagiNya segala kepujian, dan Dia berkuasa ke atas setiap sesuatu. Ya Allah tiada yang menghalang dengan apa yang dikerjakan. Dan tiada yang dapat dikerjakan dengan apa yang Kau halangi. Tiada manfaat keatas sesuatu yg diusahakan selain dari kehendakMu"
			},
			{
				"lang": "en",
				"text": "None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent. O Allah, none can prevent what You have willed to bestow and none can bestow what You have willed to prevent, and no wealth or majesty can benefit anyone, as from You is all wealth and majesty."
			},
			{
				"lang": "id",
				"text": "Tiada Tuhan (yang berhak disembah) kecuali Allah Yang Maha Esa, tidak ada sekutu bagiNya. BagiNya puji dan bagi-Nya kerajaan. Dia Maha Kuasa atas segala sesuatu. Ya Allah, tidak ada yang mencegah apa yang Engkau berikan dan tidak ada yang memberi apa yang Engkau cegah. Tidak berguna kekayaan dan kemuliaan itu bagi pemiliknya (selain iman dan amal solehnya). Hanya dari-Mu kekayaan dan kemuliaan"
			}
		]
	},
	{
		"arabic": "لَا إلهَ إلاّ اللَّهُ وَحْدَهُ لَا شَرِيْكَ لهُ، لَهُ الْمُلْكُ وَلَهُ الحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرُ، لَا حَـوْلَ وَلَا قُـوَّةَ إِلاّ بِاللّهِ، لَا إلَهَ إلاّ اللّـهُ، وَلَا نَعْـبُـدُ إِلاّ إيَّـاهُ، لَهُ النِّعْـمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّـنَاءُ الحَـسَنُ، لَا إلَهَ إلاَّ اللّهُُ مُخْلِصِـينَ لَـهُ الدِّيْنَ وَلَوْ كَـرِهَ الْكَـافِرُوْنَ",
		"source": "(Muslim, 3/258, no. 935)",
		"toRepeat": 0,
		"translations":
		[
			{
				"lang": "ms",
				"text": "Tiada Tuhan yang disembah melainkan Allah, Tuhan Yang Maha Esa tiada sekutu bagiNya. BagiNya segala kerajaan dan bagiNya segala pujian. Dia Yang menghidupkan dan mematikan. Dialah Yang Maha Kuasa ke atas segala sesuatu. Tidak ada daya dan kekuatan kecuali dengan pertolongan Allah. Tiada Tuhan yang hak disembah kecuali Allah. Kami tidak menyembah kecuali kepada-Nya. Bagi-Nya nikmat, anugerah dan pujaan yang baik. Tiada Tuhan yang hak disembah kecuali Allah, dengan memurnikan ibadah kepada-Nya, sekalipun orang-orang kafir membenci."
			},
			{
				"lang": "en",
				"text": "None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent. There is no might nor power except with Allah, none has the right to be worshipped except Allah and we worship none except Him. For Him is all favour, grace, and glorious praise. None has the right to be worshipped except Allah and we are sincere in faith and devotion to Him although the disbelievers detest it"
			},
			{
				"lang": "id",
				"text": "Tiada Tuhan (yang berhak disembah) kecuali Allah, Yang Maha Esa, tidak ada sekutu bagiNya. BagiNya kerajaan dan pujaan. Dia Mahakuasa atas segala sesuatu. Tidak ada daya dan kekuatan kecuali (dengan pertolongan) Allah. Tiada Tuhan (yang hak disembah) kecuali Allah. Kami tidak menyembah kecuali kepadaNya. Bagi-Nya nikmat, anugerah dan pujaan yang baik. Tiada Tuhan (yang hak disembah) kecuali Allah, dengan memurnikan ibadah kepadaNya, sekalipun orang-orang kafir sama benci."
			}
		]
	},
	{
		"arabic": "سُـبْحَانَ اللَّهِ",
		"source": "",
		"toRepeat": 33,
		"translations":
		[
			{
				"lang": "ms",
				"text": "Maha Suci Allah."
			},
			{
				"lang": "en",
				"text": "Glory be to Allah."
			},
			{
				"lang": "id",
				"text": "Maha Suci Allah."
			}
		]
	},
	{
		"arabic": "ٱلْحَمْدُ لِلَّهِ",
		"source": "",
		"toRepeat": 33,
		"translations":
		[
			{
				"lang": "ms",
				"text": "Segala puji bagi Allah."
			},
			{
				"lang": "en",
				"text": "Praise be to Allah."
			},
			{
				"lang": "id",
				"text": "Segala puji bagi Allah."
			}
		]
	},
	{
		"arabic": "اَللَّهُ أكْـبَرُ",
		"source": "",
		"toRepeat": 33,
		"translations":
		[
			{
				"lang": "ms",
				"text": "Allah maha besar."
			},
			{
				"lang": "en",
				"text": "Allah is the greatest."
			},
			{
				"lang": "id",
				"text": "Allah maha besar."
			}
		]
	},
	{
		"arabic": "لَا إلَهَ إلاَّ اللَّهُ وَحْـدَهُ لَا شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الحَْمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَـدِيْرُ",
		"source": "(Muslim, 3/262, no. 939)",
		"toRepeat": 0,
		"translations":
		[
			{
				"lang": "ms",
				"text": "Tiada Tuhan yang disembah melainkan Allah, Tuhan Yang Maha Esa tiada sekutu bagiNya. BagiNya segala kerajaan dan bagiNya segala pujian. Dia Yang menghidupkan dan mematikan. Dialah Yang Maha Kuasa ke atas segala sesuatu."
			},
			{
				"lang": "en",
				"text": "None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent"
			},
			{
				"lang": "id",
				"text": "Tidak ada Tuhan (yang hak disembah) kecuali Allah Yang Maha Esa, tidak ada sekutu bagiNya. BagiNya kerajaan. BagiNya pujaan. Dia-lah Yang Mahakuasa atas segala sesuatu."
			}
		]
	},
	{
		"arabic": "ٱللَّهُ لَآ إِلَـٰهَ إِلَّا هُوَ ٱلْحَىُّ ٱلْقَيُّومُ ۚ لَا تَأْخُذُهُۥ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُۥ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۗ مَن ذَا ٱلَّذِى يَشْفَعُ عِندَهُۥٓ إِلَّا بِإِذْنِهِۦ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَىْءٍ مِّنْ عِلْمِهِۦٓ إِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرْسِيُّهُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ ۖ وَلَا يَـُٔودُهُۥ حِفْظُهُمَا ۚ وَهُوَ ٱلْعَلِىُّ ٱلْعَظِيمُ ٢٥٥",
		"source": "(an-Nasa’i No. 100 dan Ibnus Sunni no. 121)",
		"toRepeat": 0,
		"translations":
		[
			{
				"lang": "ms",
				"text": "Allah, tiada Tuhan (yang berhak disembah) melainkan Dia, Yang Tetap hidup, Yang Kekal selama-lamanya mentadbirkan (sekalian makhlukNya). Yang tidak mengantuk usahkan tidur. Yang memiliki segala yang ada di langit dan yang ada di bumi. Tiada sesiapa yang dapat memberi syafaat (pertolongan) di sisiNya melainkan dengan izinNya. yang mengetahui apa yang ada di hadapan mereka dan apa yang ada di belakang mereka, sedang mereka tidak mengetahui sesuatu pun dari (kandungan) ilmu Allah melainkan apa yang Allah kehendaki (memberitahu kepadanya). Luasnya Kursi Allah (ilmuNya dan kekuasaanNya) meliputi langit dan bumi; dan tiadalah menjadi keberatan kepada Allah menjaga serta memelihara keduanya. Dan Dia lah Yang Maha Tinggi (darjat kemuliaanNya), lagi Maha Besar (kekuasaanNya)"
			},
			{
				"lang": "en",
				"text": "Allah! There is no god (worthy of worship) except Him, the Ever-Living, All-Sustaining. Neither drowsiness nor sleep overtakes Him. To Him belongs whatever is in the heavens and whatever is on the earth. Who could possibly intercede with Him without His permission? He (fully) knows what is ahead of them and what is behind them, but no one can grasp any of His knowledge—except what He wills (to reveal). His Seat1 encompasses the heavens and the earth, and the preservation of both does not tire Him. For He is the Most High, the Greatest."
			},
			{
				"lang": "id",
				"text": "“Allah tidak ada Ilah (yang berhak disembah) melainkan Dia Yang Hidup kekal lagi terus-menerus mengurus (makhluk-Nya); tidak mengantuk dan tidak tidur. Kepunyaan-Nya apa yang di langit dan di bumi. Siapakah yang dapat memberi syafaat di sisi Allah tanpa izin-Nya. Allah mengetahui apa-apa yang di hadapan mereka dan di belakang mereka, dan mereka tidak mengetahui apa-apa dari ilmu Allah melainkan apa yang dikehendaki-Nya. Kursi Allah meliputi langit dan bumi. Dan Allah tidak merasa berat memelihara keduanya, dan Allah Maha Tinggi lagi Maha Besar."
			}
		]
	},
	{
		"arabic": "بِسْمِ ٱللَّهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ\nقُلْ هُوَ ٱللَّهُ أَحَدٌ ١ ٱللَّهُ ٱلصَّمَدُ ٢ لَمْ يَلِدْ وَلَمْ يُولَدْ ٣ وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ ٤",
		"source": "",
		"toRepeat": 0,
		"translations":
		[
			{
				"lang": "ms",
				"text": "Katakanlah (wahai Muhammad): (Tuhanku) ialah Allah Yang Maha Esa. Allah Yang menjadi tumpuan sekalian makhluk untuk memohon sebarang hajat. Ia tiada beranak, dan Ia pula tidak diperanakkan. Dan tidak ada sesiapapun yang serupa denganNya."
			},
			{
				"lang": "en",
				"text": "Say, He is Allah, (who is) One. Allah, the Eternal Refuge. He neither begets nor is born. Nor is there to Him any equivalent."
			},
			{
				"lang": "id",
				"text": "Katakanlah: Dialah Allah, Yang Maha Esa. Allah adalah Ilah yang bergantung kepada-Nya segala urusan. Dia tidak beranak dan tiada pula diperanakkan, dan tidak ada seorang pun yang setara dengan Dia."
			}
		]
	},
	{
		"arabic": "بِسْمِ ٱللَّهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ \nقُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ ١ مِن شَرِّ مَا خَلَقَ ٢ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ٣ وَمِن شَرِّ ٱلنَّفَّـٰثَٰتِ فِي ٱلۡعُقَدِ ٤ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ٥",
		"source": "",
		"toRepeat": 0,
		"translations":
		[
			{
				"lang": "ms",
				"text": "Katakanlah (wahai Muhammad); Aku berlindung kepada (Allah) Tuhan yang menciptakan sekalian makhluk. Dari bencana makhluk-makhluk yang Ia ciptakan. Dan dari bahaya gelap apabila ia masuk. Dan dari kejahatan makhluk-makhluk yang menghembus-hembus pada simpulan-simpulan (dan ikatan-ikatan). Dan dari kejahatan orang yang dengki apabila ia melakukan dengkinya."
			},
			{
				"lang": "en",
				"text": "Say, I seek refuge in the Lord of daybreak. From the evil of that which He created. And from the evil of darkness when it settles. And from the evil of the blowers in knots. And from the evil of an envier when he envies."
			},
			{
				"lang": "id",
				"text": "Katakanlah: Aku berlindung kepada Rabb yang menguasai Subuh, dari kejahatan makhluk-Nya, dan dari kejahatan malam apabila telah gelap gelita, dan dari kejahatan-kejahatan wanita tukang sihir yang menghembus pada buhul-buhul, dan dari kejahatan orang yang dengki apabila ia dengki."
			}
		]
	},
	{
		"arabic": "بِسْمِ ٱللَّهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ \nقُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ ١ مَلِكِ ٱلنَّاسِ ٢ إِلَـٰهِ ٱلنَّاسِ ٣ مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ ٤ ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ ٥ مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ ٦",
		"source": "(Abu Dawud, 2/86, an-Nasai 3/68. at-Tirmidzi, 2/8. al-Bukhari, 9/62)",
		"toRepeat": 0,
		"translations":
		[
			{
				"lang": "ms",
				"text": "Katakanlah (wahai Muhammad): Aku berlindung kepada (Allah) Pemulihara sekalian manusia. Yang Menguasai sekalian manusia. Tuhan yang berhak disembah oleh sekalian manusia. Dari kejahatan pembisik penghasut yang timbul tenggelam. Yang melemparkan bisikan dan hasutannya ke dalam hati manusia. (Iaitu pembisik dan penghasut) dari kalangan jin dan manusia"
			},
			{
				"lang": "en",
				"text": "Say, I seek refuge in the Lord of mankind. The Sovereign of mankind. The God of mankind. From the evil of the retreating whisperer. Who whispers (evil) into the breasts of mankind. From among the jinn and mankind."
			},
			{
				"lang": "id",
				"text": "Katakanlah: Aku berlindung kepada Rabb manusia. Raja manusia. Sembahan manusia, dari kejahatan (bisikan) syaitan yang biasa bersembunyi, yang membisikkan (kejahatan) ke dalam dada manusia, dari jin dan manusia."
			}
		]
	}
]
